class FancyText {
  static alphabet (char) {
    const dict = {
      a: [/* 'Ⓐ', 'ⓐ', '🄰', */'Ꭿ', '∀', '₳', 'Ǻ', 'ǻ', 'α', 'ά', 'Ǡ', 'Ắ', 'ắ', 'Ằ', 'ằ', 'ẳ', 'Ẵ', 'ẵ', 'Ä', 'ª', 'ä', 'Å', 'À', 'Á', 'Â', 'å', 'ã', 'â', 'à', 'á', 'Ã', 'ᗩ', '@', 'Ⱥ', 'Ǟ', '𝖆', '𝕬'],
      b: [/* 'Ⓑ', 'ⓑ', '🄱', */'ℬ', 'Ᏸ', 'β', '฿', 'ß', 'Ђ', 'ᗷ', 'ᗽ', 'ᗾ', 'ᗿ', 'Ɓ', 'ƀ', 'ხ', '␢', 'Ᏸ', 'ᗸ', 'ᗹ', 'ᛔ', '𝖇', '𝕭'],
      c: [/* 'Ⓒ', 'ⓒ', '🄲', */'☾', 'ℭ', 'ℂ', 'Ç', '¢', 'ç', 'Č', 'ċ', 'Ċ', 'ĉ', 'ς', 'Ĉ', 'ć', 'Ć', 'č', 'Ḉ', 'ḉ', '⊂', 'Ꮸ', '₡', '¢', '𝖈', '𝕮'],
      d: [/* 'Ⓓ', 'ⓓ', '🄳', */'ᗫ', 'Ɗ', 'Ď', 'ď', 'Đ', 'đ', 'ð', '∂', '₫', 'ȡ', 'ᚦ', 'ᚧ', '𝖉', '𝕯'],
      e: [/* 'Ⓔ', 'ⓔ', '🄴', */'ℰ', 'ℯ', 'ໂ', '६', '£', 'Ē', '℮', 'ē', 'Ė', 'ė', 'Ę', 'ě', 'Ě', 'ę', 'Έ', 'ê', 'ξ', 'Ê', 'È', '€', 'É', '∑', 'Ế', 'Ề', 'Ể', 'Ễ', 'é', 'è', 'ع', 'Є', 'є', 'έ', 'ε', 'Ҿ', 'ҿ', '𝖊', '𝕰'],
      f: [/* 'Ⓕ', 'ⓕ', '🄵', */'ℱ', '₣', 'ƒ', '∮', 'Ḟ', 'ḟ', 'ჶ', 'ᶂ', 'φ', 'ᚨ', 'ᚩ', 'ᚪ', 'ᚫ', '𝖋', '𝕱'],
      g: [/* 'Ⓖ', 'ⓖ', '🄶', */'Ꮹ', 'Ꮆ', 'ℊ', 'Ǥ', 'ǥ', 'Ĝ', 'ĝ', 'Ğ', 'ğ', 'Ġ', 'ġ', 'Ģ', 'ģ', 'פ', 'ᶃ', '₲', '𝖌', '𝕲'],
      h: [/* 'Ⓗ', 'ⓗ', '🄷', */'ℍ', 'ℋ', 'ℎ', 'ℌ', 'ℏ', 'ዙ', 'Ꮵ', 'Ĥ', 'Ħ', 'ħ', 'Ή', '廾', 'Ћ', 'ђ', 'Ḩ', 'Һ', 'ḩ', '♄', 'ਮ', '𝖍', '𝕳'],
      i: [/* 'Ⓘ', 'ⓘ', '🄸', */'ℐ', 'ί', 'ι', 'Ï', 'Ί', 'Î', 'ì', 'Ì', 'í', 'Í', 'î', 'ϊ', 'ΐ', 'Ĩ', 'ĩ', 'Ī', 'ī', 'Ĭ', 'ĭ', 'İ', 'į', 'Į', 'Ꭵ', '𝖎', '𝕴'],
      j: [/* 'Ⓙ', 'ⓙ', '🄹', */'ჟ', 'Ĵ', 'ĵ', 'ᶖ', 'ɉ', 'ℑ', '𝖏', '𝕵'],
      k: [/* 'Ⓚ', 'ⓚ', '🄺', */'₭', 'Ꮶ', 'Ќ', 'k', 'ќ', 'ķ', 'Ķ', 'Ҝ', 'ҝ', 'ᶄ', 'Ҡ', 'ҡ', '𝖐', '𝕶'],
      l: [/* 'Ⓛ', 'ⓛ', '🄻', */'ℒ', 'ℓ', 'Ŀ', 'ŀ', 'Ĺ', 'ĺ', 'Ļ', 'ļ', 'λ', '₤', 'Ł', 'ł', 'ľ', 'Ľ', 'Ḽ', 'ḽ', 'ȴ', 'Ꮭ', '𝖑', '𝕷'],
      m: [/* 'ⓜ', '🄼', 'ℳ', */'ʍ', 'ᶆ', 'Ḿ', 'ḿ', 'ᗰ', 'ᙢ', '爪', '₥', 'ጠ', 'ᛖ', '𝖒', '𝕸'],
      n: [/* 'Ⓝ', 'ⓝ', '🄽', */'ℕ', 'η', 'ñ', 'ח', 'Ñ', 'ή', 'ŋ', 'Ŋ', 'Ń', 'ń', 'Ņ', 'ņ', 'Ň', 'ň', 'ŉ', 'ȵ', 'ℵ', '₦', 'ห', 'ກ', '⋒', '𝖓', '𝕹'],
      o: [/* 'Ⓞ', 'ⓞ', '🄾', */'ℴ', 'ტ', '٥', 'Ό', 'ó', 'ό', 'σ', 'ǿ', 'Ǿ', 'Θ', 'ò', 'Ó', 'Ò', 'Ô', 'ô', 'Ö', 'ö', 'Õ', 'õ', 'ờ', 'ớ', 'ọ', 'Ọ', 'ợ', 'Ợ', 'ø', 'Ø', 'Ό', 'Ở', 'Ờ', 'Ớ', 'Ổ', 'ổ', 'Ợ', 'Ō', 'ō', 'Ő', 'ő', '𝖔', '𝕺'],
      p: [/* 'Ⓟ', 'ⓟ', '🄿', */'ℙ', '℘', 'ρ', 'Ꭾ', 'Ꮅ', '尸', 'Ҏ', 'ҏ', 'ᶈ', '₱', '☧', 'ᖘ', 'ק', '₽', 'թ', 'Ƿ', 'Ҏ', 'ҏ', '𝖕', '𝕻'],
      q: [/* 'Ⓠ', 'ⓠ', '🅀', */'ℚ', 'q', 'Q', 'ᶐ', 'Ǭ', 'ǭ', 'ჹ', '૧', '𝖖', '𝕼'],
      r: [/* 'Ⓡ', 'ⓡ', '🅁', */'ℝ', 'ℜ', 'ℛ', '℟', 'ჩ', 'ᖇ', 'ř', 'Ř', 'ŗ', 'Ŗ', 'ŕ', 'Ŕ', 'ᶉ', 'Ꮢ', '尺', 'ᚱ', '𝖗', '𝕽'],
      s: [/* 'Ⓢ', 'ⓢ', '🅂', */'Ꮥ', 'Ṧ', 'ṧ', 'ȿ', '§', 'Ś', 'ś', 'š', 'Š', 'ş', 'Ş', 'ŝ', 'Ŝ', '₰', '∫', '$', 'ֆ', 'Տ', 'క', '𝖘', '𝕾'],
      t: [/* 'Ⓣ', 'ⓣ', '🅃', */'₸', '†', 'T', 't', 'τ', 'Ţ', 'ţ', 'Ť', 'ť', 'ŧ', 'Ŧ', '干', 'Ṫ', 'ṫ', 'ナ', 'Ꮏ', 'Ꮖ', 'テ', '₮', '⍡', '𝖙', '𝕿'],
      u: [/* 'Ⓤ', 'ⓤ', '🅄', */'∪', 'ᙀ', 'Ũ', 'Ủ', 'Ừ', 'Ử', 'Ữ', 'Ự', 'ύ', 'ϋ', 'Ù', 'ú', 'Ú', 'ΰ', 'ù', 'Û', 'û', 'Ü', 'ử', 'ữ', 'ự', 'ü', 'ừ', 'Ũ', 'ũ', 'Ū', 'ū', 'Ŭ', 'ŭ', 'ų', 'Ų', 'ű', 'Ű', 'ů', 'Ů', 'น', 'Ա', '𝖚', '𝖀'],
      v: [/* 'Ⓥ', 'ⓥ', '🅅', */'∨', '√', 'Ꮙ', 'Ṽ', 'ṽ', 'ᶌ', '℣', '𝖛', '𝖁'],
      w: [/* 'Ⓦ', 'ⓦ', '🅆', */'₩', 'ẃ', 'Ẃ', 'ẁ', 'Ẁ', 'ẅ', 'ώ', 'ω', 'ŵ', 'Ŵ', 'Ꮤ', 'Ꮃ', 'ฬ', 'ᗯ', 'ᙡ', 'Ẅ', 'ѡ', 'ಎ', 'ಭ', 'Ꮚ', 'Ꮗ', 'ผ', 'ฝ', 'พ', 'ฟ', '𝖜', '𝖂'],
      x: [/* 'Ⓧ', 'ⓧ', '🅇', */'χ', '×', '✗', '✘', '᙭', 'ჯ', 'Ẍ', 'ẍ', 'ᶍ', 'א', '𝖝', '𝖃'],
      y: [/* 'Ⓨ', 'ⓨ', '🅈', */'ɣ', 'Ꭹ', 'Ꮍ', 'Ẏ', 'ẏ', 'ϒ', 'ɤ', '￥', 'ע', '௶', 'Ⴘ', '𝖞', '𝖄'],
      z: [/* 'Ⓩ', 'ⓩ', '🅉', */'ℤ', '乙', 'Ẑ', 'ẑ', 'ɀ', 'Ꮓ', '𝖟', '𝖅']
    }
    if (!char) return dict
    char = char.toLowerCase()
    return dict[char]
  }

  static t2s (txt, ele, chance) {
    chance = chance || 1
    txt.split('').forEach(char => {
      const span = document.createElement('span')
      const keys = Object.keys(FancyText.alphabet())
      if (!keys.includes(char.toLowerCase())) {
        span.dataset.char = char
        span.textContent = char
        ele.appendChild(span)
      } else {
        const arr = FancyText.alphabet(char.toLowerCase())
        const ran = Math.floor(Math.random() * arr.length)
        span.dataset.char = char
        const str = Math.random() <= chance ? arr[ran] : char
        span.textContent = str
        ele.appendChild(span)
      }
    })
  }

  static fancify (ele, chance) {
    const txt = ele.textContent
    ele.innerHTML = ''
    FancyText.t2s(txt, ele, chance)
  }

  static update (ele, chance) {
    let txt = ''
    Array.from(ele.children).forEach(span => { txt += span.dataset.char })
    ele.innerHTML = ''
    FancyText.t2s(txt, ele, chance)
  }

  static animate (ele, speed, chance) {
    FancyText.fancify(ele, chance)
    const loop = setInterval(() => {
      FancyText.update(ele, chance)
    }, speed || 1000 / 60)
    return loop
  }
}

window.FancyText = FancyText
